//TCHN251# JOB NOTIFY=&SYSUID
//STEP001  EXEC PGM=SORT
//SORTIN   DD DSN=TCHN251.PS.INP.CUST.MAS,DISP=SHR
//SORTOUT  DD DSN=TCHN251.PS.INP.CUST.MAS,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  INCLUDE MEMBER=SD251MAS
/*
//