//TCHN251# JOB NOTIFY=&SYSUID
//STEP001  EXEC PGM=DSNUTILB
//DD1      DD DSN=TCHN251.PS.INP.CUST.MAS,DISP=SHR
//UTPRINT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LOAD DATA INDDN(DD1)
        INTO TABLE MFDB.CUSTOMER_MASTER
        REPLACE
        FIELD POSITION(1:7) CUSTOMER_ID INTEGER
        FIELD POSITION(8:37) CUSTOMER_NAME VARCHAR(30)
        FIELD POSITION(38:47) CURRENT_DUES DECIMAL(6,2)
        FIELD POSITION(48:55) LAST_AMT_PAID DECIMAL(4,2)
        FIELD POSITION(56:56) GENDER CHAR(1)
/*