//TCHN251# JOB NOTIFY=&SYSUID
//STEP001  EXEC PGM=SORT
//SORTIN   DD DSN=TCHN251.PS.INP.CUST.PMT,DISP=SHR
//SORTOF1  DD DSN=TCHN251.PS.INP.CUST.PMT.SORT,DISP=SHR
//SORTOF2  DD DSN=TCHN251.PS.INP.CUST.PMT.REJ,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  INCLUDE MEMBER=SD251PMT
/*
//