//TECN251  JOB NOTIFY=&SYSUID
//STEP001  EXEC PGM=IEFBR14
//EMPDATAO DD DSN=TECN251.PS.OUT,DISP=(MOD,DELETE,DELETE),
// 	      SPACE=(TRK,(1,1))
//STEP002  EXEC PGM=FILEHND1
//STEPLIB  DD DSN=TECN251.COB.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//EMPDATAI DD DSN=TECN251.OUTPUT.FILE1,DISP=SHR
//EMPDATAO DD DSN=TECN251.OUTPUT.FILE2,DISP=SHR
